<template>
    <!--about-->
    <el-main class="wmm-about">
        <div class="wmm-wrap">
            <div class="left">
                <div class="item">
                    <h1 class="title">关于</h1>
                    <p class="part">
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                    </p>
                </div>
                <div class="item">
                    <h1 class="title">关于</h1>
                    <p class="part">
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                    </p>
                </div>
                <div class="item" v-for="item in 30" :key="item">
                    <h1 class="title">联系我</h1>
                    <p class="part">
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                        使用在线主题编辑器，可以修改定制 Element 所有全局和组件的 Design
                        Tokens，并可以方便地实时预览样式改变后的视觉。同时它还可以基于新的定制样式生成完整的样式文件包，供直接下载使用（关于如何使用下载的主题包，请参考本节「引入自定义主题」部分）。
                        也可以使用主题编辑器 Chrome 插件，在任何使用 Element 开发的网站上配置并实时预览主题。
                    </p>
                </div>
            </div>
            <div class="right">
                sdfsdf
            </div>
        </div>
        <el-backtop target=".wmm-about"></el-backtop>
    </el-main>
</template>

<script>
export default {
    components: {},
    data() {
        return {}
    },
    mounted() {
    },
    methods: {}
}
</script>

<style lang="scss">
.wmm-about {
    border: 1px solid red;

    .wmm-wrap {
        max-width: 992px;
        border: 1px solid blue;
        margin: 0 auto;
        display: flex;

        .item {
            .title {
                font-size: 16px;
                padding: 10px 0;
            }

            .part {
            }
        }
    }
}

</style>